# DirectShapeReferenceOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeReferenceOptions Constructor
DirectShapeReferenceOptions Class See Also
---
Constructs a new DirectShapeRefOptions instance with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public DirectShapeReferenceOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DirectShapeReferenceOptions()
```

# See Also
DirectShapeReferenceOptions Class
DirectShapeReferenceOptions Overload
Autodesk.Revit.DB Namespace